# Insert

In [3]:
import pandas as pd                                                     #Importing pandas

var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})                   #Creating dataframe

var                                                                     #Printing dataframe

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [4]:
var.insert(1,"python",var["A"])                                       #inserting additional column

var                                                                   #Printing dataframe

   A  python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  6
4  5       5  5

In Pandas library we can use `insert()` function to insert additional data in a dataframe. `insert()` function has three parameters `insert(index,"name",value)` where index is the positioning of new column, name is the name of new column and value is the data you want to insert. In above example the indexing of the new column was 1, name was "python" and the data was a copy of existing column `var["A"]`

In [6]:
var.insert(1,"python_1",[11,12,13,14,15])                          #Inserting new column using list

var                                                                #Printing dataframe

   A  python_1  python  B
0  1        11       1  9
1  2        12       2  8
2  3        13       3  7
3  4        14       4  6
4  5        15       5  5

In this example we used a new list of data instead of copying it from old column. 
>*Note:* The list has to contain same length of data as previously existing dataframe

In [7]:
var["python_12"] = var["A"][:3]                                    #inserting new column using slicing

var                                                                #Printing dataframe

   A  python_1  python  B  python_12
0  1        11       1  9        1.0
1  2        12       2  8        2.0
2  3        13       3  7        3.0
3  4        14       4  6        NaN
4  5        15       5  5        NaN

We did not use `insert()` function here to add new column, instead we used list slicing.
> *Note:* List slicing is not in scope of this tutorial so we will not be explaining it

## Delete

In [8]:
var1 = var.pop("B")                                              #deleting col b from var dataframe 

var1                                                             #printing removed col

0    9
1    8
2    7
3    6
4    5
Name: B, dtype: int64

There are two ways to delete data from a dataframe using Pandas, `pop()` and `del` functions. In the example above we used `pop()` function to remove column `var["B"]` from `var` dataframe.
> *Note:* If you dont specifye the index `pop()` finction removes the last column from the dataframe by default.

In [9]:
var                                                           #printing dataframe

   A  python_1  python  python_12
0  1        11       1        1.0
1  2        12       2        2.0
2  3        13       3        3.0
3  4        14       4        NaN
4  5        15       5        NaN

In [10]:
del var["A"]                                               #deleting col A from var dataframe using del function

var                                                        #Printing dataframe

   python_1  python  python_12
0        11       1        1.0
1        12       2        2.0
2        13       3        3.0
3        14       4        NaN
4        15       5        NaN